STMicroelectronics/STM32CubeMP13/Drivers/BSP/STM32MP13xx_DISCO/stm32mp13xx_disco_stpmic1.c
static uint16_t ldo4_voltage_table[] = {
  3300, // 3,3
};

static uint16_t vref_ddr_voltage_table[] = {
  3300, // 3,3
};

/*
  Table of Regulators in PMIC SoC
*/



static regul_struct regulators_table[] = {
    {
      .id       = STPMU1_BUCK1,
      .voltage_table   = buck1_voltage_table,
      .voltage_table_size = ARRAY_SIZE(buck1_voltage_table),
      .control_reg   = BUCK1_CONTROL_REG,
      .low_power_reg   = BUCK1_PWRCTRL_REG,
      .rank      = OTP_RANK_BUCK1,
    },
    {
      .id       = STPMU1_BUCK2,
      .voltage_table   = buck2_voltage_table,
      .voltage_table_size = ARRAY_SIZE(buck2_voltage_table),
      .control_reg   = BUCK2_CONTROL_REG,
      .low_power_reg   = BUCK2_PWRCTRL_REG,
      .rank      = OTP_RANK_BUCK2,
    },
    {
      .id       = STPMU1_BUCK3,
      .voltage_table   = buck3_voltage_table,
      .voltage_table_size = ARRAY_SIZE(buck3_voltage_table),
      .control_reg   = BUCK3_CONTROL_REG,
      .low_power_reg   = BUCK3_PWRCTRL_REG,
      .rank      = OTP_RANK_BUCK3,
    },
    {
      .id       = STPMU1_BUCK4,
      .voltage_table   = buck4_voltage_table,
      .voltage_table_size = ARRAY_SIZE(buck4_voltage_table),
      .control_reg   = BUCK4_CONTROL_REG,
      .low_power_reg   = BUCK4_PWRCTRL_REG,
      .rank      = OTP_RANK_BUCK4,
    },
    {
      .id       = STPMU1_LDO1,
      .voltage_table   = ldo1_voltage_table,
      .voltage_table_size = ARRAY_SIZE(ldo1_voltage_table),
      .control_reg   = LDO1_CONTROL_REG,
      .low_power_reg   = LDO1_PWRCTRL_REG,
      .rank      = OTP_RANK_LDO1,
    },
    {
      .id       = STPMU1_LDO2,
      .voltage_table   = ldo2_voltage_table,
      .voltage_table_size = ARRAY_SIZE(ldo2_voltage_table),
      .control_reg   = LDO2_CONTROL_REG,
      .low_power_reg   = LDO2_PWRCTRL_REG,
      .rank      = OTP_RANK_LDO2,
    },

    {
      .id       = STPMU1_LDO3,
      .voltage_table   = ldo3_voltage_table,
      .voltage_table_size = ARRAY_SIZE(ldo3_voltage_table),
      .control_reg   = LDO3_CONTROL_REG,
      .low_power_reg   = LDO3_PWRCTRL_REG,
      .rank      = OTP_RANK_LDO3,
    },
    {
      .id       = STPMU1_LDO4,
      .voltage_table   = ldo4_voltage_table,
      .voltage_table_size = ARRAY_SIZE(ldo4_voltage_table),
      .control_reg   = LDO4_CONTROL_REG,
      .low_power_reg   = LDO4_PWRCTRL_REG,
      .rank      = OTP_RANK_LDO4,
    },
    {
      .id       = STPMU1_LDO5,
      .voltage_table   = ldo5_voltage_table ,
      .voltage_table_size = ARRAY_SIZE(ldo5_voltage_table),
      .control_reg   = LDO5_CONTROL_REG,
      .low_power_reg   = LDO5_PWRCTRL_REG,
      .rank      = OTP_RANK_LDO5,
    },
    {
      .id       = STPMU1_LDO6,
      .voltage_table   = ldo6_voltage_table ,
      .voltage_table_size = ARRAY_SIZE(ldo6_voltage_table),
      .control_reg   = LDO6_CONTROL_REG,
      .low_power_reg   = LDO6_PWRCTRL_REG,
      .rank      = OTP_RANK_LDO6,
    },
    {
      .id       = STPMU1_VREFDDR,
      .voltage_table   = vref_ddr_voltage_table ,
      .voltage_table_size = ARRAY_SIZE(vref_ddr_voltage_table),
      .control_reg   = VREF_DDR_CONTROL_REG,
      .low_power_reg   = VREF_DDR_PWRCTRL_REG,
      .rank      = OTP_RANK_VREFDDR,
    },
};

#define MAX_REGUL  ARRAY_SIZE(regulators_table)

 /**
  * @}
  */

/** @defgroup STM32MP13XX_DISCO_STPMU_Private_Functions Private Functions
  * @{
  */

/* Private function prototypes -----------------------------------------------*/
void STPMU1_IrqHandler(void);
void STPMU1_INTn_Callback(PMIC_IRQn IRQn);
static regul_struct *STPMU1_Get_Regulator_Data(PMIC_RegulId_TypeDef id);
static uint8_t STPMU1_Voltage_Find_Index(PMIC_RegulId_TypeDef id, uint16_t milivolts);

/* Private functions ---------------------------------------------------------*/


static regul_struct *STPMU1_Get_Regulator_Data(PMIC_RegulId_TypeDef id)
{
  uint8_t i ;

  for (i = 0U ; i < MAX_REGUL ; i++ )
  {
    if (id == regulators_table[i].id)
    {
      return &regulators_table[i];
    }
  }
  /* id not found */
  BSP_Error_Handler();
  return NULL;
}

static uint8_t STPMU1_Voltage_Find_Index(PMIC_RegulId_TypeDef id, uint16_t milivolts)
{
  regul_struct *regul = STPMU1_Get_Regulator_Data(id);
  uint8_t i;
  for ( i = 0U ; i < regul->voltage_table_size ; i++)
  {
    if ( regul->voltage_table[i] == milivolts ) {
      return i;
    }
  }
  /* voltage not found */
  BSP_Error_Handler();
  return 0;
}

void STPMU1_Enable_Interrupt(PMIC_IRQn IRQn)
{
  uint8_t irq_reg , irq_reg_value ;

  if (IRQn >= IRQ_NR)
  {
    return ;
  }

  /* IRQ register is IRQ Number divided by 8 */
  irq_reg = (uint8_t)IRQn >> 3U ;

  /* value to be set in IRQ register corresponds to BIT_PMIC(7-N) where N is the Interrupt id modulo 8 */
  irq_reg_value = 1U << ( 7U - ( (uint8_t)IRQn%8U ) );

  /* Clear previous event stored in latch */
  STPMU1_Register_Write(ITCLEARLATCH1_REG+irq_reg, irq_reg_value );

  /* Clear relevant mask to enable interrupt */
  STPMU1_Register_Write(ITCLEARMASK1_REG+irq_reg, irq_reg_value );

}

extern void STPMU1_Disable_Interrupt(PMIC_IRQn IRQn)
{
  uint8_t irq_reg , irq_reg_value ;

  if (IRQn >= IRQ_NR)
  {
    return ;
  }

  /* IRQ register is IRQ Number divided by 8 */
  irq_reg = (uint8_t)IRQn >> 3U ;

  /* value to be set in IRQ register corresponds to BIT_PMIC(7-N) where N is the Interrupt id modulo 8 */
  irq_reg_value = 1U << ( 7U - ( (uint8_t)IRQn%8U ) );

  /* Clear previous event stored in latch */
  STPMU1_Register_Write(ITCLEARLATCH1_REG+irq_reg, irq_reg_value );

  /* Set relevant mask to disable interrupt */
  STPMU1_Register_Write(ITSETMASK1_REG+irq_reg, irq_reg_value );

}


void STPMU1_IrqHandler(void)
{
  uint8_t irq_reg,mask,latch_events,i;

  for (irq_reg = 0U ; irq_reg < STM32_PMIC_NUM_IRQ_REGS ; irq_reg++)
  {
    /* Get latch events & active mask from register */
    mask = STPMU1_Register_Read(ITMASK1_REG+irq_reg);
    latch_events = STPMU1_Register_Read(ITLATCH1_REG+irq_reg) & ~mask ;

    /* Go through all bits for each register */
    for (i = 0U ; i < 8U ; i++ )
    {
      if ( (latch_events & ( 1U << i )) != 0U )
      {
        /* Callback with parameter computes as "PMIC Interrupt" enum */
        STPMU1_INTn_Callback( (PMIC_IRQn )(uint8_t)(((irq_reg*8U) + (7U-i))));
      }
    }
    /* Clear events in appropriate register for the event with mask set */
    STPMU1_Register_Write(ITCLEARLATCH1_REG+irq_reg, latch_events );
  }

