STMicroelectronics/STM32CubeMP13/Drivers/BSP/STM32MP13xx_DISCO/stm32mp13xx_disco_stpmic1.c
}

void STPMU1_Sw_Reset(void)
{
  /* Write 1 in bit 0 of MAIN_CONTROL Register */
  STPMU1_Register_Update((uint8_t)MAIN_CONTROL_REG, (uint8_t)1U , (uint8_t)SOFTWARE_SWITCH_OFF_ENABLED);
}

void STPMU1_Regulator_Enable(PMIC_RegulId_TypeDef id)
{
  regul_struct *regul = STPMU1_Get_Regulator_Data(id);

  STPMU1_Register_Update((uint8_t)regul->control_reg, (uint8_t)BIT_PMIC(0U), (uint8_t)BIT_PMIC(0U));
}

void STPMU1_Regulator_Disable(PMIC_RegulId_TypeDef id)
{
  regul_struct *regul = STPMU1_Get_Regulator_Data(id);

  STPMU1_Register_Update((uint8_t)regul->control_reg, (uint8_t)0U, (uint8_t)BIT_PMIC(0U));
}

uint8_t STPMU1_Is_Regulator_Enabled(PMIC_RegulId_TypeDef id)
{
  uint8_t val ;

  regul_struct *regul = STPMU1_Get_Regulator_Data(id);

  val = STPMU1_Register_Read(regul->control_reg);

  return (val&0x1U);
}

void STPMU1_Regulator_Voltage_Set(PMIC_RegulId_TypeDef id,uint16_t milivolts)
{
  uint8_t voltage_index = STPMU1_Voltage_Find_Index(id,milivolts);
  regul_struct *regul = STPMU1_Get_Regulator_Data(id);
  STPMU1_Register_Update(regul->control_reg, voltage_index<<2 , 0xFCU );
}

/* register direct access */
uint8_t STPMU1_Register_Read(uint8_t register_id)
{
  uint32_t status = BSP_ERROR_NONE;
  uint8_t Value = 0;

  status = (uint32_t)BSP_I2C4_ReadReg(STPMU1_I2C_ADDRESS, (uint16_t)register_id, &Value, 1U);

  /* Check the communication status */
  if(status != (uint32_t)BSP_ERROR_NONE)
  {
    BSP_Error_Handler();
  }
  return Value;
}

void STPMU1_Register_Write(uint8_t register_id, uint8_t value)
{
  uint32_t status = BSP_ERROR_NONE;

  status = (uint32_t)BSP_I2C4_WriteReg(STPMU1_I2C_ADDRESS, (uint16_t)register_id, &value, 1U);

  /* Check the communication status */
  if(status != (uint32_t)BSP_ERROR_NONE)
  {
    BSP_Error_Handler();
  }

  /* verify register content */
  if ((register_id!=WATCHDOG_CONTROL_REG) && (register_id<=0x40U))
  {
    uint8_t readval = STPMU1_Register_Read(register_id);
    if (readval != value)
    {
      BSP_Error_Handler();
    }
  }
  return ;
}

void STPMU1_Register_Update(uint8_t register_id, uint8_t value, uint8_t mask)
{
  uint8_t initial_value ;

  initial_value = STPMU1_Register_Read(register_id);

  /* Clear bits to update */
  initial_value &= ~mask;

  /* Update appropriate bits*/
  initial_value |= ( value & mask );

  /* Send new value on I2C Bus */
  STPMU1_Register_Write(register_id, initial_value);

  return ;
}


/*
 *
 * PMIC init
 *    pmic provides power supply on this board
 *    it is configured to turn off some power supply in standby mode
 *
 */


static uint32_t BSP_PMIC_MspInit(I2C_HandleTypeDef *hi2c)
{
  uint32_t  status = BSP_ERROR_NONE;
  GPIO_InitTypeDef  GPIO_InitStruct;

  /*##-1- Configure the I2C clock source, GPIO and Interrupt #*/
  BSP_I2C4_Init();

  /*##-2- Configure PMIC GPIOs Interface ########################################*/

  /* INTn - Interrupt Line - Active Low (Falling Edge) */
  PMIC_INTn_CLK_ENABLE();
  GPIO_InitStruct.Pin       = PMIC_INTn_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
  GPIO_InitStruct.Pull      = GPIO_PULLUP; //GPIO_NOPULL;
  GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_InitStruct.Alternate = 0U;
  BSP_ENTER_CRITICAL_SECTION(PMIC_INTn_PORT);
  HAL_GPIO_Init(PMIC_INTn_PORT, &GPIO_InitStruct);
  BSP_EXIT_CRITICAL_SECTION(PMIC_INTn_PORT);

  /* Enable and set INTn EXTI Interrupt  */
#if defined(CORE_CA7)
  IRQ_SetPriority((IRQn_ID_t)PMIC_INTn_EXTI_IRQ, 0);
  IRQ_Enable((IRQn_ID_t)PMIC_INTn_EXTI_IRQ);
#endif

  return status;
}


static uint32_t BSP_PMIC_MspDeInit(I2C_HandleTypeDef *hi2c)
{
  UNUSED(hi2c);

  uint32_t  status = BSP_ERROR_NONE;
/*##-1- Reset I2C Clock / Disable peripherals and GPIO Clocks###############*/
  status = (uint32_t)BSP_I2C4_DeInit();

  /*##-2- Disable PMIC clk ###########################################*/
  PMIC_INTn_CLK_DISABLE();

  /*##-3- Disable the NVIC for PMIC ##########################################*/
#if defined(CORE_CA7)
  IRQ_Disable((IRQn_ID_t)PMIC_INTn_EXTI_IRQ);
#endif
  BSP_ENTER_CRITICAL_SECTION(PMIC_INTn_PORT);
  HAL_GPIO_DeInit(PMIC_INTn_PORT,PMIC_INTn_PIN);
  BSP_EXIT_CRITICAL_SECTION(PMIC_INTn_PORT);

  return status;
}

uint32_t BSP_PMIC_Is_Device_Ready(void)
{
  uint32_t  status = BSP_ERROR_NONE;

  /* Write the TxBuffer1 at @0, then read @0 when device ready */
  if ((uint32_t)BSP_I2C4_IsReady(STPMU1_I2C_ADDRESS, 1) != (uint32_t)BSP_ERROR_NONE)
  {
    status = (uint32_t)BSP_ERROR_BUSY;
  }
  return status ;
}

/* Use Xls I2C COnfiguration Tools with I2C Clock config + output clocks requirement */
#define I2C_TIMING     0x10805E89U

uint32_t BSP_PMIC_Init(void)
{
  uint32_t status = BSP_ERROR_NONE;

  /*##-1- Configure the I2C peripheral ######################################*/
  BSP_PMIC_MspInit(&hpmic_i2c4);

  status = BSP_PMIC_Is_Device_Ready();
  if ( status != (uint32_t)BSP_ERROR_NONE )
  {
    return status;
  }

  if (STPMU1_Register_Read(VERSION_STATUS_REG) != 0x21U)
  {
    status = (uint32_t)BSP_ERROR_BUS_FAILURE;
    return status;
  }

  STPMU1_Enable_Interrupt(IT_PONKEY_R);
  STPMU1_Enable_Interrupt(IT_PONKEY_F);

  return BSP_ERROR_NONE;
}

uint32_t BSP_PMIC_DeInit(void)
{
  uint32_t  status = BSP_ERROR_NONE;
  if(HAL_I2C_GetState(&hpmic_i2c4) != HAL_I2C_STATE_RESET)
  {
    /* Deinit the I2C */
    BSP_PMIC_MspDeInit(&hpmic_i2c4);

  }
  return status;
}

/*
 *
 * following are configurations for this board
 * same configuration than linux
 *
 *  BSP_PMIC_InitRegulators set the regulators for boot
 *  BSP_PMIC_PrepareLpStop set the low power registers for LPSTOP mode
 *    should be called by user before entering is CSTOP
 *
 *
 */
/* following are configurations */
uint32_t BSP_PMIC_InitRegulators(void)
{
  uint32_t  status = BSP_ERROR_NONE;

  STPMU1_Register_Write(MAIN_CONTROL_REG, 0x04U);
  STPMU1_Register_Write(VIN_CONTROL_REG, 0xc0U);

  STPMU1_Register_Write(MASK_RESET_BUCK_REG, 0x04U);

  /* vddcpu */
  STPMU1_Regulator_Voltage_Set(STPMU1_BUCK1, 1250U);
  STPMU1_Regulator_Enable(STPMU1_BUCK1);

  /* vdd_ddr */
  STPMU1_Regulator_Voltage_Set(STPMU1_BUCK2, 1350U);
  STPMU1_Regulator_Disable(STPMU1_BUCK2);

  /* vdd */
  STPMU1_Regulator_Voltage_Set(STPMU1_BUCK3, 3300U);
  STPMU1_Regulator_Enable(STPMU1_BUCK3);

  /* vddcore */
  STPMU1_Regulator_Voltage_Set(STPMU1_BUCK4, 1250U);
  STPMU1_Regulator_Enable(STPMU1_BUCK4);

  /* vdd_adc */
  STPMU1_Regulator_Voltage_Set(STPMU1_LDO1, 3300U);
  STPMU1_Regulator_Enable(STPMU1_LDO1);

  /* ldo2 is unused */
  /* lod3 is unused */

