STMicroelectronics/STM32CubeMP13/Drivers/BSP/STM32MP13xx_DISCO/stm32mp13xx_disco_stpmic1.c
  /* vdd_usb */
  STPMU1_Regulator_Voltage_Set(STPMU1_LDO4, 3300U);
  STPMU1_Regulator_Enable(STPMU1_LDO4);

  /* vdd_sd */
  STPMU1_Regulator_Voltage_Set(STPMU1_LDO5, 2900U);
  STPMU1_Regulator_Enable(STPMU1_LDO5);

  /* v1v8_periph */
  STPMU1_Regulator_Voltage_Set(STPMU1_LDO6, 1800U);
  STPMU1_Regulator_Enable(STPMU1_LDO6);

  STPMU1_Regulator_Disable(STPMU1_VREFDDR);

  /* v3v3_sw   enable usb SWOUT , enable active discharge */
  STPMU1_Register_Write(USB_CONTROL_REG, 0x34U);

  return status;
}

uint32_t BSP_PMIC_PrepareLpStop(void)
{
  STPMU1_Register_Write(BUCK1_PWRCTRL_REG, STPMU1_Register_Read(BUCK1_CONTROL_REG));
  STPMU1_Register_Write(BUCK2_PWRCTRL_REG, STPMU1_Register_Read(BUCK2_CONTROL_REG));
  STPMU1_Register_Write(BUCK3_PWRCTRL_REG, STPMU1_Register_Read(BUCK3_CONTROL_REG));
  STPMU1_Register_Write(BUCK4_PWRCTRL_REG, STPMU1_Register_Read(BUCK4_CONTROL_REG));
  STPMU1_Register_Write(LDO1_PWRCTRL_REG, STPMU1_Register_Read(LDO1_CONTROL_REG));
  STPMU1_Register_Write(LDO2_PWRCTRL_REG, STPMU1_Register_Read(LDO2_CONTROL_REG));
  STPMU1_Register_Write(LDO3_PWRCTRL_REG, STPMU1_Register_Read(LDO3_CONTROL_REG));
  STPMU1_Register_Write(LDO4_PWRCTRL_REG, STPMU1_Register_Read(LDO4_CONTROL_REG));
  STPMU1_Register_Write(LDO5_PWRCTRL_REG, STPMU1_Register_Read(LDO5_CONTROL_REG));
  STPMU1_Register_Write(LDO6_PWRCTRL_REG, STPMU1_Register_Read(LDO6_CONTROL_REG));
  STPMU1_Register_Write(VREF_DDR_PWRCTRL_REG, STPMU1_Register_Read(VREF_DDR_CONTROL_REG));

  /* PWR_ON pin changes when enter in STOP */
  SET_BIT(PWR->CR1, PWR_CR1_LPCFG);

  return BSP_ERROR_NONE;
}

uint32_t BSP_PMIC_PrepareLpLvStop(void)
{
  BSP_PMIC_PrepareLpStop();

  /* vdd_cpu and vddcore in retention */
  STPMU1_Register_Write(BUCK1_PWRCTRL_REG, 0x31U); /* 0.9v */
  STPMU1_Register_Write(BUCK4_PWRCTRL_REG, 0x31U); /* 0.9v */

  /* PWR_ON pin changes when enter in STOP */
  SET_BIT(PWR->CR1, PWR_CR1_LPCFG);

  return BSP_ERROR_NONE;
}

uint32_t BSP_PMIC_PrepareLpLvStop2(void)
{
  BSP_PMIC_PrepareLpStop();

  /* vdd_cpu is off */
  STPMU1_Register_Write(BUCK1_PWRCTRL_REG, 0x30U); /* off */
  /* vddcore in retention */
  STPMU1_Register_Write(BUCK4_PWRCTRL_REG, 0x31U); /* 0.9v */

  /* PWR_ON pin changes when enter in STOP */
  SET_BIT(PWR->CR1, PWR_CR1_LPCFG);

  return BSP_ERROR_NONE;
}

uint32_t BSP_PMIC_PrepareStandbySelfRefresh(void)
{
  BSP_PMIC_PrepareLpStop();

  /* all but vdd, and ddr power supply on */
  STPMU1_Register_Write(BUCK1_PWRCTRL_REG, 0x0U);
  STPMU1_Register_Write(BUCK4_PWRCTRL_REG, 0x0U);

  STPMU1_Register_Write(LDO1_PWRCTRL_REG, 0x0U);
  STPMU1_Register_Write(LDO4_PWRCTRL_REG, 0x0U);
  STPMU1_Register_Write(LDO5_PWRCTRL_REG, 0x0U);
  STPMU1_Register_Write(LDO6_PWRCTRL_REG, 0x0U);

  return BSP_ERROR_NONE;
}

uint32_t BSP_PMIC_PrepareStandby(void)
{
  BSP_PMIC_PrepareStandbySelfRefresh();

  /* only keep only vdd on */
  STPMU1_Register_Write(BUCK2_PWRCTRL_REG, 0x0U);
  STPMU1_Register_Write(VREF_DDR_PWRCTRL_REG, 0x0U);

  return BSP_ERROR_NONE;
}

uint32_t BSP_PMIC_SwitchOff(void)
{
  uint32_t  status = BSP_ERROR_NONE;

  STPMU1_Register_Write(MAIN_CONTROL_REG, 0x01U);
  return status;
}

__weak void BSP_PMIC_INTn_Callback(PMIC_IRQn IRQn)
{
}

void STPMU1_INTn_Callback(PMIC_IRQn IRQn) {
  BSP_PMIC_INTn_Callback(IRQn);
};

void BSP_PMIC_INTn_IRQHandler(void)
{
  /* Call HAL EXTI IRQ Handler to clear appropriate flags */
  HAL_GPIO_EXTI_IRQHandler((uint16_t)PMIC_INTn_PIN);

  STPMU1_IrqHandler();
}

#else
#warning PMIC Board config not defined !!!
#endif

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
